var errorMsg = {
	0 : {
		title : "ทดสอบข้อผิดพลาด 0.",
		description : "This is test for error code."
	}
	,1 : {
		title : "เกิดข้อผิดพลาดร้ายแรง",
		description : "กรุณาติดต่อผู้ดูแล"
	}
		
	// 1XXX is a general error;
	,1001 : {
		title : "เข้าสู่ระบบไม่ถูกต้อง",
		description : "คุณเข้าสู่ระบบไม่ถูกต้อง ระบบจะนำคุณไปยังหน้าล็อกอิน"
	}
	,1002 : {
		title : "เซสชั่นของผู้ใช้ไม่ถูกต้อง",
		description : "กรุณาล็อกอินใหม่ เนื่องจากเซสชั่นไม่ถูกต้อง อาจเกิดขึ้นได้เนื่องจากมีผู้ล็อกอินซ้อน หรือไม่มีการกระทำใดๆ เกินเวลาที่กำหนด"
	}
	,1003 :{
		title : "ชื่อผู้ใช้และ/หรือรหัสผ่านไม่ถูกต้อง",
		description : "ชื่อผู้ใช้ไม่มีอยู่ในฐานข้อมูล หรือไม่ตรงกับรหัสผ่านที่คุณป้อน"
	}
	,1004 :{
		title : "เกิดข้อผิดพลาดจากการดึงข้อความ",
		description : "ไม่สามารถดึงข้อความล่าสุดจากระบบได้ กรุณาติดต่อผู้ดูแล",
	}
	,1005 : {
		title : "ไม่สามารถติดต่อกับ Facebook ได้",
		description : "ไม่สามารถดึงข้อมูลจาก Facebook ได้ กรุณาตรวจสอบว่าคุณได้ล็อกอินเข้าสู่เฟสบุคแล้ว ลองใหม่อีกครั้ง"
	}
	
	// 2XXX is a Character Error;
	,2001 :{
		title : "แต้มสถานะไม่เพียงพอ",
		description : "กรุณาตรวจสอบว่าแต้มที่ใช้เพิ่มค่าสถานะมีอยู่และเพียงพอต่อการใช้งาน"
	}
	,2002 :{
		title : "ไม่ทราบสถานะที่ต้องการ",
		description : "ชื่อสถานะไม่ถูกต้อง หรือคุณกำลังลองดี!!"
	}
	,2003 :{
		title : "จำนวนเงินไม่พอ",
		description : "เงินของคุณมีน้อยกว่าที่ระบบต้องการใช้"
	}
	// 3XXX is a Event Error;
	,3001 :{
		title: "ไม่รู้จักเหตุการณ์",
		description : "ไม่สามารถทำงานให้กับเหตุการณ์ที่ไม่รู้จักได้"
	}
	,3002 :{
		title: "ไม่รู้จักประเภทของเหตุการณ์",
		description : "ไม่สามารถทำงานให้กับเหตุการณ์ที่ไม่ทราบประเภทได้"
	}
	
	// 4XXX is a Battle Error;
	,4001 :{
		title : "ไม่มีเซสชั่นของการต่อสู้",
		description : "ไม่สามารถเชื่อมต่อการต่อสู้ได้เนื่องจากไม่สามารถสร้างเซสชั่นได้"
	}
	
	,4002 :{
		title : "ไม่พบข้อมูลตัวละครที่ต้องการ",
		description : "ไม่สามารถดึงข้อมูลตัวละครที่ต้องการได้ หรือตัวละครนั้นไม่มีอยู่"
	}
	
	,4003 :{
		title : "เรียกใช้งานต่อสู้ซ้ำ",
		description : "ระบบกำลังประมวลผลการต่อสู้/ร้องขอ กรุณารอสักครู่"
	}
		
	,4004 :{
		title : "ตัวละครเป้าหมายไม่ได้อยู่แผนที่เดียวกัน",
		description : "ไม่สามารถต่อสู้กับตัวละครที่อยู่ต่างแผนที่ได้"
	}
	
	,4005 :{
		title : "Attack unknow target",
		description : "Cannot found target type"
	}
	
	,4006 :{
		title : "Connot found monster' information",
		description : "Monster's id is invalid"
	}
	
	,4007 :{
		title : "Exp calculateing error",
		description : "Cannot calculate Exp"
	}
	
	,4008 :{
		title : "Item drop error",
		description : "Cannot got item drop"
	}
	
	// 5XXX is a Map Error;
	,5001 :{
		title: "แผนที่ที่ไม่รู้จัก",
		description : "ไม่สามารถดึงข้อมูลแผนที่ได้"
	}
	
	//6XXX is a Item Error;
	,6001 :{
		title: "ไม่พบไอเท็มที่ต้องการ",
		description : "ไอเท็มไม่มีอยู่ หรือจำนวนไอเท็มไม่เพียงพอ"
	}
	,6002 :{
		title : "การจัดการไม่ถูกต้อง",
		description : "คำสั่งเรียกใช้ไอเท็มไม่ถูกต้อง หรือคุณกำลังลองดี!!"
	}
	,6003 :{
		title : "ไม่ทราบประเภทไอเท็ม",
		description : "ไอเท็มของประเภทไม่ถูกต้อง"
	}
	,6004 :{
		title : "ไม่สามารถใช้ไอเท็มขณะต่อสู้ได้",
		description : "ไม่สามารถใช้ไอเท็มขณะต่อสู้ได้ แนะนำว่าทีหลังอย่าทำอีก !!"
	}
	
	//7XXX is a Skill Error;
	,7001 :{
		title : "มีสกิลอยู่แล้ว",
		description : "สกิลที่่มีอยู่แล้วไม่สามารถเรียนซ้ำได้"
	}
	,7002 : {
		title : "ไม่สามารถเรียนสกิลต่างเมืองได้",
		description : "เมืองที่ท่านอยู่ไม่มีสกิลที่ต้องการ"
	}
	
}
