var poem = [
	'วิชาฝีมือในแผ่นดินมีหลายระดับ,ในการต่อสู้พิสูจน์ความเหลื่อมล้ำ,...,ความชำนาญในกระบวนท่าที่ใช้,บางคราก็อาจพลิกผลแพ้ชนะได้'
	//,'เพลง "ฝ่ามือพุทธองค์",นับเป็นยอดวิชาในยุทธภพ,ฟังว่ากระบวนท่านี้แฝงไว้ด้วย,พลังฝ่ามือ ๕ ส่วน!,พลังหมัด ๔ ส่วน'
	//,'ทำเลวนั้นทำง่าย ทำดีนั้นทำยาก,...,ท่านที่นับถือทราบหรือไม่ว่า,เพลง "หมัดแปดทิศ" เป็นวิชาฝีมือชั้นที่ ๔ ในยุทธภพ'
	,'วิชาฝีมือล้วนก่อเกิดจากลมปราณ,ลมปราณเคลื่อนที่ พลังเคลื่อนที่,...,ทุกกระบวนล้วนแฝงกำลังภายใน,ท่านต้องหมั่นฝึกปรือให้มากไว้'
	,'ความอ่อนน้อมเป็นของประหลาด,ท่านยิ่งมีให้บุคคลอื่นมากเท่าไร,ยิ่งได้รับกลับคืนมาเป็นทวีคูณ,...,ถึงกับนับได้ว่าเป็นยอดวิชาหนึ่ง!'
	,'การกระทำอยู่ที่คน สำเร็จอยู่ที่ฟ้า,ขึ้นชื่อว่ายอดวิชามิได้มาง่ายดาย,...,ข้อหนึ่งนั้นขึ้นอยู่กับบุญวาสนา,ประการต่อมาขึ้นกับตัวท่านเอง'
	//,'ยามอันตราย วัดความกล้าหาญ,...,ท่านที่นับถือทราบหรือไม่ว่า เพลง"ฝ่ามือเสือดาว" เป็นวิชาฝีมือชั้นที่ ๒ ในยุทธจักร'
	,'เวรย่อมระงับด้วยการไม่จองเวร,ความแค้นเป็นเพียงภาพลวงตา'
	,'ศีลสู่สมาธิ จากสมาธิสู่ปัญญา,...,หากต้องการฝึกฝนยอดวิชา,ต้องใช้สถานที่อันเงียบสงบ!'
	,'กระต่ายเดือน ๓ คึกคัก คึกคัก,จิ้งจอกเดือน ๙ คึกคัก คึกคัก,เวลายามดึก อย่าคิดลึกนัก,...,เวลาคึกคัก พลังจะล้ำลึก'
	,'ยอดวิชาย่อมต่างจากวิชาทั่วไป,ความชำนาญในกระบวนท่า,นอกจากอยู่ที่การใช้ออกแล้ว,...,ยังอยู่ที่สำนึกกระบวนท่าด้วย!'
	,'อันเคล็ดยอดวิชาดรรชนียูไล,แม้ไม่ซับซ้อนแต่ต้องตีความ,ฟังว่าในยุคก่อนนี้มียอดฝีมือ,...,ใช้เวลาเป็นแรมปีจึงบรรลุได้'
	,'ในหมู่โจรมีเพียงความกล้า,จึงรักษาศักดิ์ศรีของตนไว้ได้,ความกล้าหาญจึงเป็นศักดิ์ศรี,...,ท่านเป็นคนมีศักดิ์ศรีไหมล่ะ?'
	,'หมัดเมานับเป็นหนึ่งในยอดวิชา,ในหนึ่งกระบวนท่าแฝงไว้ด้วย,เพลงหมัดมากมายหลายแขนง,...,หลายแขนงนี้มิรู้มากน้อยเท่าใด?'
	,'เวลาท่านเผชิญหน้ายอดฝีมือ,บางครั้งการหลีกเลี่ยงไม่ปะทะ,ก็เป็นทางเลือกที่ไม่เลวนัก,...,ทั้งไม่มีใครสามารถดูแคลนได้'
	,'มีอุดมการณ์ แต่ไม่มานะปฏิบัติ,จึงลงเอยเป็นความคิดฟุ้งซ่าน'
	,'คนเห็นแก่ตัว มักแล้งน้ำใจ,คนเย่อหยิ่งมักดูถูกผู้อื่น'
	,'ความตายดุจดังกลับสู่มาตุภูมิ,แพ้ชนะเพียงสายลมพัดผ่าน,...,หากเอาแต่หลบลี้การต่อสู้,ชาวยุทธจักรย่อมจะดูแคลน'
];

var battle_request = [
	'ชาวยุทธไม่ต่อยตีไม่รู้จัก,วันนี้เราสองพบพานโดยบังเอิญ,ควรทำความรู้จักฝีมือกันไว้บ้าง,...,ท่านมีความเห็นเป็นอย่างไร!',
	'อาชาดีมิสามารถตัดสินด้วยสายตา,ยอดฝีมือมิอาจวัดได้ด้วยท่าทาง,เราพอรู้จักวิชาฝีมืออยู่ท่าสองท่า,...,น้อมรับคำแนะนำจากท่านแล้ว',
	'ฮ่า ฮ่า ฮ่า...ท่านที่นับถือ,ดูท่าท่านรู้จักวิชาฝีมืออยู่เล็กน้อย,วิชาฝีมือของเราก็ดั่งแมวสามขา,...,เราขอแสดงความทุเรศแล้ว!'
];
